[
    {
      "id": "09.03.01-общий",
      "название_программы": "Информатика и вычислительная техника",
      "профиль_или_специализация": null,
      "обязательные_предметы": [
        {"название": "математика (профиль)", "балл": 40},
        {"название": "русский язык", "балл": 40}
      ],
      "предметы_по_выбору_примечание": "информатика - 44 или физика - 39",
      "предметы_по_выбору_детали": [
          {"название": "информатика", "балл": 44},
          {"название": "физика", "балл": 39}
      ],
      "описание": "С каждым годом информационные технологии все больше проникают в жизнь в людей, отрасль динамично развивается по всем направлениям, что приводит компании к осознанию потребности в специалистах, которые умеют не только программировать, но и создавать и администрировать информационные системы и умные устройства. Комплексная подготовка таких специалистов напрямую зависит от содержания программы и степени его соответствия вызовам нового времени, а также методов и подходов к организации образовательного процесса. Сумма всех обозначенных доводов гармонично находит свое отражение в программе “Информатика и вычислительная техника”.\nУникальность образовательной программы обеспечивает бинарный подход: студенты проходят подготовку как по аппаратному, так и программному обеспечению информационных систем. Студенты и выпускники могут участвовать в проектах по разработке или внедрению информационной системы на любом этапе  жизненного цикла продукта. Конечный портрет будущей профессии напрямую зависит от интересов и выбранной индивидуальной траектории.\nСтуденты ИВТ изучают строение и архитектуру компьютеров, операционных систем, а также осваивают основные языки программирования, учатся анализировать и прогнозировать потоки информации, создавать поисковые системы, сети хранения, обработки и передачи информации.",
      "проходной_балл_2024": 241,
      "бюджетные_места": 200,
      "срок_обучения_лет": 4
    },
    {
      "id": "09.03.01-аии",
      "название_программы": "Информатика и вычислительная техника",
      "профиль_или_специализация": "Алгоритмы искусственного интеллекта",
      "обязательные_предметы": [
        {"название": "математика (профиль)", "балл": "не указано в описании профиля, см. базовое направление"},
        {"название": "русский язык", "балл": "не указано в описании профиля, см. базовое направление"}
      ],
      "предметы_по_выбору_примечание": "не указано в описании профиля, см. базовое направление",
      "предметы_по_выбору_детали": [],
      "описание": "Знаете ли Вы значение терминов «матрица путаницы», «горячее кодирование», «случайный лес» и «переобучение»? Специалисты в области развития искусственного интеллекта и наши студенты регулярно имеют дело с этими, на первый взгляд, необычными терминами. Их значение и применение на практике изучается в рамках современной программы «Алгоритмы искусственного интеллекта».\nС первого курса студенты на учебных занятиях изучают алгоритмы, которые используются в машинном обучении и технологиях компьютерного зрения, а также при обработке естественного языка и других областях, связанных с искусственным интеллектом. Они обучают компьютерные системы выполнять интеллектуальные и творческие задачи, которые традиционно считались предназначенными для человека. Это могут быть чат-боты, сервисы по генерации изображений и многие другие.\nВыпускники программы смогут найти привлекательное место работы в любой отрасли, поскольку инструменты искусственного интеллекта с каждым днём всё больше применяются в разных сферах деятельности человека: на производстве, в банковском секторе, социальных проектах, медицине и образовании, науке и технике. Неужели мы находимся на пороге эпохи восстания машин? Мы однозначно уверены, что у студентов уже сейчас есть возможность начать новую историю настоящего и будущего.",
      "проходной_балл_2024": 246,
      "бюджетные_места": 100,
      "срок_обучения_лет": 4
    },
    {
      "id": "09.03.03-общий",
      "название_программы": "Прикладная информатика",
      "профиль_или_специализация": null,
      "обязательные_предметы": [
        {"название": "математика (профиль)", "балл": 40},
        {"название": "русский язык", "балл": 40}
      ],
      "предметы_по_выбору_примечание": "информатика - 44 или физика - 39",
      "предметы_по_выбору_детали": [
          {"название": "информатика", "балл": 44},
          {"название": "физика", "балл": 39}
      ],
      "описание": "Интенсивно развивающаяся прикладная информатика – это творческий путь в перспективное будущее. Студенты, научившиеся применять прикладные решения в практике реальных задач науки и бизнеса смогут без труда встроиться в любую ИТ-компанию, или открыть свой стартап за счет универсальности их подготовки.\nНаиболее перспективные проекты реализуются на стыке нескольких предметных областей, одной из которых являются информационные технологии. Умение применять ИТ-инструменты при решении проблемных задач других отраслей является залогом успешного будущего.\nСтуденты изучают многообразие дисциплин технического цикла, а также экономику, дизайн и гуманитарные науки. Знания, полученные на данном направлении, имеют широкий спектр возможностей применения, поэтому выпускники могут работать исследователями (например, создавать и сопровождать программы, обеспечивающие моделирование различных процессов; анализ материалов с их последующей классификацией, выявлением закономерностей и др.), а также специалистами как в IT-компаниях по разработке программного обеспечения, так и в организациях, занимающихся внедрением и эксплуатацией информационных систем и технологий.",
      "проходной_балл_2024": null,
      "бюджетные_места": null,
      "срок_обучения_лет": null
    },
    {
      "id": "09.03.03-пии",
      "название_программы": "Прикладная информатика",
      "профиль_или_специализация": "Прикладной искусственный интеллект",
      "обязательные_предметы": [],
      "предметы_по_выбору_примечание": null,
      "предметы_по_выбору_детали": [],
      "описание": "Искусственный интеллект широко применяется в IT-сфере. Он позволяет создавать интеллектуальные системы, которые могут принимать решения, обучаться и оптимизировать свою работу. ИИ применяют в самых разных сферах — начиная от анализа данных и прогнозирования и заканчивая кибербезопасностью, персонализацией и рекомендациями.\nВ 2024 году ИРИТ-РТФ в партнёрстве с одной из крупнейших российских IT-компаний VK впервые открывает набор на программу «Прикладной искусственный интеллект». В основе программы — практика на рабочих задачах и учебных кейсах из сферы ИИ и машинного обучения.\nНа программе студенты изучат алгоритмы и структуры данных, основы программирования на языке Python, получат базовые знания в сфере статистики и математического моделирования. Особое внимание в рамках программы будет уделено разработке рекомендательных систем и анализу больших данных.\nБлагодаря индивидуальным образовательным траекториям, студенты смогут изучить дополнительный язык программирования, исходя из собственного интереса: С#, JavaScript, TypeScript, Java, С++ и другие.",
      "проходной_балл_2024": null,
      "бюджетные_места": null,
      "срок_обучения_лет": null
    },
    {
      "id": "09.03.04-общий",
      "название_программы": "Программная инженерия",
      "профиль_или_специализация": null,
      "обязательные_предметы": [
        {"название": "математика (профиль)", "балл": 40},
        {"название": "русский язык", "балл": 40}
      ],
      "предметы_по_выбору_примечание": "информатика - 44 или физика - 39",
      "предметы_по_выбору_детали": [
          {"название": "информатика", "балл": 44},
          {"название": "физика", "балл": 39}
      ],
      "описание": "“Программная инженерия” - флагманская программа бакалавриата ИРИТ-РТФ, выпускники которой становятся универсальными ИТ-специалистами и знают всю кухню создания проектов изнутри: от написания кода и дизайна до юридических тонкостей и ГОСТов.\nПрограммный инженер – не просто программист, а многофункциональный специалист, занимающийся решением задач на всех стадиях производства программного продукта. В его обязанности, как правило, входит анализ потребностей пользователей, разработка и внедрение программы, а также тестирование и поддержка.\nВсе эти требования и факторы внимательным образом учтены при разработке содержания нашей образовательной программы и включают в себя как базовые языки программирования (C#, Java, C++ и Python), так и специальные. Будущие программные инженеры обучаются по системе индивидуальных образовательных траекторий и в течение всего периода обучения могут познакомиться со спецификой той или иной профессии, выбрать наиболее подходящий трек подготовки.",
      "проходной_балл_2024": null,
      "бюджетные_места": null,
      "срок_обучения_лет": null
    },
    {
      "id": "09.03.04-бкс",
      "название_программы": "Программная инженерия", 
      "профиль_или_специализация": "Безопасность компьютерных систем",
      "обязательные_предметы": [],
      "предметы_по_выбору_примечание": null,
      "предметы_по_выбору_детали": [],
      "описание": "Информация по очно-заочной форме доступна по !\nВ наше время всеобщей цифровизации многим крупным предприятиям и организациям понадобился свой новый супергерой – защитник интересов мирных жителей против злодеев ИТ-сферы. Он спасает конфиденциальные данные, находит уязвимости в системах и предотвращает утечки информации, проводит разъяснительные беседы с сотрудниками, чтобы они не делали глупостей в Интернете. \nУже долгие годы ИРИТ-РТФ успешно готовит новых супергероев на образовательной программе «Безопасность компьютерных систем», целью которой является подготовка высококвалифицированных специалистов с крепкими математическими знаниями, а также умениями, навыками программирования и системного администрирования, ориентированные на отражение и предотвращение угроз безопасности в компьютерных и корпоративных сетях.\nВ процессе обучения студенты изучают архитектуру компьютерных сетей, методы защиты информации, инструменты мониторинга, тестирования и управления. В учебную программу также входят основы разработки программного обеспечения на языках программирования C#, Python, C++.",
      "проходной_балл_2024": null,
      "бюджетные_места": null,
      "срок_обучения_лет": null
    },
    {
      "id": "11.03.01",
      "название_программы": "Радиотехника",
      "профиль_или_специализация": null,
      "обязательные_предметы": [
        {"название": "математика (профиль)", "балл": 40},
        {"название": "русский язык", "балл": 40}
      ],
      "предметы_по_выбору_примечание": "информатика - 44, физика - 39",
      "предметы_по_выбору_детали": [
          {"название": "информатика", "балл": 44},
          {"название": "физика", "балл": 39}
      ],
      "описание": "Программа бакалавриата “Радиотехника” направлена на подготовку инженерно-технических специалистов, занимающихся разработкой и проектированием радиоэлектронных средств и систем различного назначения.\nПрограмма ориентирует выпускников на активное участие и инициативу в прорывном развитии радиоэлектронных производств, на освоение новой техники, внедрение новых технологий, изменение культуры производства, следование основным направлениям развития четвертой промышленной революции.\nОсобенностью программы является выраженная практико-ориентированность процесса обучения. Увеличенный объем преддипломной практики позволяет выполнять выпускные квалификационные работы в интересах профильных предприятий, что дает возможность обучающимся последовательно овладеть необходимым уровнем квалификации, обеспечивает включение выпускников в производственный процесс без дополнительного переобучения.",
      "проходной_балл_2024": null, 
      "бюджетные_места": null,
      "срок_обучения_лет": null
    },
    {
      "id": "11.03.02",
      "название_программы": "Инфокоммуникационные технологии и системы связи",
      "профиль_или_специализация": null,
      "обязательные_предметы": [
        {"название": "математика (профиль)", "балл": 40},
        {"название": "русский язык", "балл": 40}
      ],
      "предметы_по_выбору_примечание": "информатика - 44, физика - 39",
      "предметы_по_выбору_детали": [
          {"название": "информатика", "балл": 44},
          {"название": "физика", "балл": 39}
      ],
      "описание": "Инфокоммуникационные технологии входят в перечень специальностей, приоритетных для российской экономики. Успешное освоение данной образовательной программы несет за собой большие перспективы и возможности для научной и профессиональной деятельности, поскольку вопросы и задачи обмена информацией по различным каналам связи будут востребованы еще очень долгие годы. Уже сегодня невозможно представить будущее человечества без новых средств и способов коммуникации.\nПрограмма подготовки будущих инженеров составлена так, чтобы полученные фундаментальные знания сразу же могли быть применены на практике. Профессиональную деятельность выпускник сможет выполнять в проектно-конструкторских, производственных, эксплуатационно-сервисных подразделениях предприятий различных отраслей экономики.\nВ учебной программе сделан особый уклон на математические основы, физику связи, электронику, информационные технологии и вычислительную технику. Профессиональные основы включают изучение сетевых технологий, телекоммуникационных схем, электромагнитных волн и полей, коммутационных систем, систем связи. На лекциях и в лабораториях учащиеся учатся планировать мобильные и другие коммуникационные сети, разрабатывают архитектуру и программное обеспечение для телекоммуникационных устройств, проектируют оптико-волоконные линии связи, а также реализуют иные задачи.",
      "проходной_балл_2024": null,
      "бюджетные_места": null,
      "срок_обучения_лет": null
    },
    {
      "id": "11.03.03",
      "название_программы": "Конструирование и технология электронных средств",
      "профиль_или_специализация": null,
      "обязательные_предметы": [
        {"название": "математика (профиль)", "балл": 40},
        {"название": "русский язык", "балл": 40}
      ],
      "предметы_по_выбору_примечание": "информатика - 44, физика - 39",
      "предметы_по_выбору_детали": [
          {"название": "информатика", "балл": 44},
          {"название": "физика", "балл": 39}
      ],
      "описание": "Жизнь современного человека сложно представить без электронных устройств. Все гаджеты и многие вещи повседневного быта, которые ждут нас дома после работы или учебы стали результатом воплощения абстрактных идей, физико-математических принципов, а также применения техник и технологий профессиональным сообществом инженеров-конструкторов.\nКонструктор объединяет и воплощает идеи схемотехников и электроников в реальные функционирующие изделия. В его функционал также входит корректировка конструкции уже используемой электроники на основе информации, получаемой от специалистов по технической эксплуатации электронных средств.\nВыпускники данной программы отличаются способностью заниматься научно-исследовательской работой в области разработки компонентов и материалов для электроники. Специфика предметной области и задач, решаемых выпускниками конструкторско-технологического направления подготовки, формирует и развивает у студентов навыки системного и критического мышления. Это направление является приоритетным для модернизации российской экономики, поэтому у выпускников открыты многочисленные возможности для трудоустройства.",
      "проходной_балл_2024": null,
      "бюджетные_места": null,
      "срок_обучения_лет": null
    },
    {
      "id": "27.03.04",
      "название_программы": "Управление в технических системах",
      "профиль_или_специализация": null,
      "обязательные_предметы": [
        {"название": "математика (профиль)", "балл": 40},
        {"название": "русский язык", "балл": 40}
      ],
      "предметы_по_выбору_примечание": "информатика - 44, физика - 39",
      "предметы_по_выбору_детали": [
          {"название": "информатика", "балл": 44},
          {"название": "физика", "балл": 39}
      ],
      "описание": "Программа бакалавриата «Управление в технических системах» предназначена для будущих инженеров. По своему содержанию она ориентирована на изучение и проектирование технических и программных средств, предназначенных для автоматизации управления технологическими процессами.\nСтуденты изучают теоретико-прикладные основы автоматизации, управления, контроля, диагностики технических процессов. В процессе обучения приобретаются практические умения и навыки по проектированию, моделированию, экспериментальному исследованию, внедрению и обслуживанию систем.\nВо время обучения студенты могут разработать современные устройства управления сначала в виде моделей на компьютере, а затем и на базе цифровой микропроцессорной техники, и увидеть результат своей работы вживую в результате реализации проектов на проектном обучении.",
      "проходной_балл_2024": null,
      "бюджетные_места": null,
      "срок_обучения_лет": null
    },
    {
      "id": "29.03.03",
      "название_программы": "Технология полиграфического и упаковочного производства",
      "профиль_или_специализация": null,
      "обязательные_предметы": [
        {"название": "математика (профиль)", "балл": 40},
        {"название": "русский язык", "балл": 40}
      ],
      "предметы_по_выбору_примечание": "информатика - 44, физика - 39, химия - 39",
      "предметы_по_выбору_детали": [
          {"название": "информатика", "балл": 44},
          {"название": "физика", "балл": 39},
          {"название": "химия", "балл": 39}
      ],
      "описание": "За последнее десятилетие полиграфическая индустрия проделала огромный прогресс. На рынке труда востребованы выпускники вузов, которые имеют соответствующую компетенцию.\nОбучение по этой программе включает использование современных программных продуктов и цифровой техники для обработки текста и иллюстраций. Студенты также изучают современные методы печати, основанные на цифровых печатных машинах, которые также доступны на кафедре. Кроме того, они изучают программирование, работу с офисными приложениями и многое другое. \nВыпускники смогут работать в сфере информационных, печатных и других технологий, включая кросс-медийные проекты. Они смогут управлять процессами производства книг, газет, журналов и других товаров промышленного и народного потребления, где требуется применение полиграфических технологий.",
      "проходной_балл_2024": null,
      "бюджетные_места": null,
      "срок_обучения_лет": null
    }
  ]